Terraform plan test (with test data):
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.stateful.module.medicare_opt_out.aws_kms_alias.pii_bucket_key_alias will be created
  + resource "aws_kms_alias" "pii_bucket_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/bfd-test-medicare-opt-out-cmk"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.stateful.module.medicare_opt_out.aws_kms_key.pii_bucket_key will be created
  + resource "aws_kms_key" "pii_bucket_key" {
      + arn                     = (known after apply)
      + deletion_window_in_days = 10
      + description             = "bfd-test-medicare-opt-out-cmk"
      + enable_key_rotation     = true
      + id                      = (known after apply)
      + is_enabled              = true
      + key_id                  = (known after apply)
      + key_usage               = (known after apply)
      + policy                  = jsonencode(
            {
              + Id        = "bfd-test-medicare-opt-out-kms-policy"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::577373831711:user/DS7H",
                              + "577373831711",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Admin Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::577373831711:role/bfd-test-fhir-role",
                              + "arn:aws:iam::577373831711:role/bfd-test-data-migration-role",
                              + "arn:aws:iam::577373831711:role/bfd-test-bfd_pipeline-role",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Role Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.stateful.module.medicare_opt_out.aws_s3_bucket.pii_bucket will be created
  + resource "aws_s3_bucket" "pii_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "bfd-test-medicare-opt-out-577373831711"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "test"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "medicare-opt-out"
          + "stack"       = "test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "bfd-test-medicare-opt-out-versioning-rule"

          + noncurrent_version_expiration {
              + days = 60
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }

      + logging {
          + target_bucket = "bfd-test-logs-577373831711"
          + target_prefix = "medicare-opt-out_s3_access_logs"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.stateful.module.medicare_opt_out.aws_s3_bucket_policy.pii_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "pii_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.stateful.module.medicare_opt_out.aws_s3_bucket_public_access_block.pii_bucket_restrictions will be created
  + resource "aws_s3_bucket_public_access_block" "pii_bucket_restrictions" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```